update README.md with diagram
